# MetersPerKilonewton Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..MetersPerKilonewton Property
UnitTypeId Class See Also
---
Meters per kilonewton.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MetersPerKilonewton { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetersPerKilonewton As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MetersPerKilonewton {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace